[M_Sage_Mission04 MissionDefinition]
MissionName="Let's go together"
MissionDescription="Professor Nakayama plans to clone Jack to give to Alice in his secret lab. [place]Aduton Railway Station[-place]. It is a lie advises them to go there and destroy Jack's DNA sample. How he got Jack's DNA is another story, but he somehow managed to lose it and take his lab.."
TurnInDescription="We are here to destroy everything and ruin your life. Claptrap was sent to us."
MissionSummary="Go to Addo East Station."
MissionGiver="Claptrap"
MissionTurnInLocation="Mr Hammerlock"
TeaserText=""

[M_Sage_Mission04:DeactivateLab MissionObjectiveDefinition]
ProgressMessage="Close the factory"

[M_Sage_Mission04:DeactivateLAbSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Close the lab"
MissionDescriptionOverride="Professor Nakayama plans to stop Jack from giving the secret lab to Elysium. [place]Adderton Railway Station[-place]. Once Jack's DNA is destroyed, all you have to do is destroy Nakayama's lab.."

[M_Sage_Mission04:DestroyDNA1 MissionObjectiveDefinition]
ProgressMessage="DNA damage"

[M_Sage_Mission04:DestroyDNA2 MissionObjectiveDefinition]
ProgressMessage="Remove accessory DNA"

[M_Sage_Mission04:DestroyDNA3 MissionObjectiveDefinition]
ProgressMessage="Fix DNA maintenance issues"

[M_Sage_Mission04:DestroyDNASet MissionObjectiveSetDefinition]
MissionSummaryOverride="Destroy Jack's DNA sample."
MissionDescriptionOverride=""

[M_Sage_Mission04:FindEntrance MissionObjectiveDefinition]
ProgressMessage="Find the cave entrance."

[M_Sage_Mission04:FindEntranceSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Sage_Mission04:FindLab MissionObjectiveDefinition]
ProgressMessage="Find the lab"

[M_Sage_Mission04:FindLabSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Sage_Mission04:GotoStation MissionObjectiveDefinition]
ProgressMessage="Go to Ardorton station"

[M_Sage_Mission04:GotoStationSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Sage_Mission04:KillEndBoss MissionObjectiveDefinition]
ProgressMessage="The Killing of Clavapincho"

[M_Sage_Mission04:KillEndBossSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Defeat Clava Pinchos, a monster created by Jack in Nakayama.."
MissionDescriptionOverride="Professor Nakayama plans to use europium to create a replica of Jack in his secret lab. [place]adover station[-place]. But after Zhongshan destroys his laboratory, he releases an experimental animal. Whose leg did you kill?..."

[M_Sage_Mission04:ReturnLodge MissionObjectiveDefinition]
ProgressMessage="Return to page"

[M_Sage_Mission04:ReturnLodgeSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

